In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [17]:
df.columns = ['first_name', 'last_name', 'email']

In [18]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [23]:
df.columns = [x.lower() for x in df.columns]

In [24]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [22]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [28]:
df.rename(columns={'first_name': 'first', 'last_name' : 'last'}, inplace=True)

In [29]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [30]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [31]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [33]:
df.loc[2, 'last'] = 'Smith'

In [34]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [35]:
df.at[2, 'last'] = 'Doe'

In [36]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
filt = (df['email'] == 'JonDoe@email.com')
df[filt]['last'] = 'Smith'

In [45]:
df.loc[filt, 'last'] = 'Smith'

In [46]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [47]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [48]:
def update_email(email):
    return email.upper()

In [ ]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [51]:
df['email'] = df['email'].apply(update_email)

In [52]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John      Doe        JOHNDOE@EMAIL.COM

In [53]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [55]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [56]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [58]:
df.shape

(3, 3)

In [59]:
df.apply(len, axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [60]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [61]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [64]:
df.map(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [65]:
df.map(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [66]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [68]:
df = df.map(str.lower)

In [69]:
df

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [70]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    NaN
1    NaN
2    NaN
Name: first, dtype: object

In [71]:
df

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [72]:
df['first'].map({'corey': 'Chris', 'jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [75]:
df['first'] = df['first'].replace({'corey': 'Chris', 'jane': 'Mary'})

In [76]:
df

   first     last                    email
0  Chris  schafer  coreymschafer@gmail.com
1   Mary      doe        janedoe@email.com
2   john      doe        johndoe@email.com